//
//  ViewController.swift
//  HW4_Karrie(Les6)
//
//  Created by Карина Дьячина on 7.12.23.
//

import UIKit

class ViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
        
        // 1. Функция вычисления факториала числа - через передачу массива в параметр функции. Массив из 6 чисел -> Факториал числа \(numbers), равен ????

        // 2. var x = [(1, "x"), (4, "y"), (6, «a»), (9, «u»), (5, «k»)]
        // Массив из кортежей - возвести Int в квадрат
        // отфильтровать только четные Int -> [4, 6]
        // упорядочить по строкам по возрастанию -> [a, k, u, x, y]

        // ********
        // 3. Написать список книг и отфильтровать книги по жанрам -> horror = []
        //var books = ["Book001": ["title": "Swift Programming", "author": "John Doe", "genre": "Programming"]]

        // 4. Объеденить 2 массива. первый массив это название групп. второй название песен
        // [2, nil, 4, nil, 3, 8, nil] - не использую compactMap

        // 5.  Создать функцию которая принимает массив чисел и умножает каждое число на 2 используя функцию map.
        
    }
}

